In [4]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify' : ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data)
ori = pd.DataFrame(exam_data)
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [5]:
print(df.head(3))

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

In [6]:
print(df.dropna())

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [7]:
print(df[["name", "score"]])

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [8]:
new_data={
 'name': ['Suresh'],
 'score': [15.5],
 'attempts': [1],
 'qualify' :['yes']
}
new = pd.DataFrame.from_dict(new_data)
new_data= pd.concat([new])
df = pd.DataFrame(exam_data)
df = df.append(new_data, ignore_index=True)
print(df)

         name  score  attempts qualify
0   Anastasia   12.5         1     yes
1        Dima    9.0         3      no
2   Katherine   16.5         2     yes
3       James    NaN         3      no
4       Emily    9.0         2      no
5     Michael   20.0         3     yes
6     Matthew   14.5         1     yes
7       Laura    NaN         1      no
8       Kevin    8.0         2      no
9       Jonas   19.0         1     yes
10     Suresh   15.5         1     yes

In [9]:
df = df.drop('attempts',axis=1) 
print(df)

         name  score qualify
0   Anastasia   12.5     yes
1        Dima    9.0      no
2   Katherine   16.5     yes
3       James    NaN      no
4       Emily    9.0      no
5     Michael   20.0     yes
6     Matthew   14.5     yes
7       Laura    NaN      no
8       Kevin    8.0      no
9       Jonas   19.0     yes
10     Suresh   15.5     yes

In [12]:
l=[]
for i in  df['score']:
    if i>10:
        result=1
        l.append(result)
    else:
        result=0
        l.append(result)

df['result']=l
print(df)

         name  score qualify  result
0   Anastasia   12.5     yes       1
1        Dima    9.0      no       0
2   Katherine   16.5     yes       1
3       James    NaN      no       0
4       Emily    9.0      no       0
5     Michael   20.0     yes       1
6     Matthew   14.5     yes       1
7       Laura    NaN      no       0
8       Kevin    8.0      no       0
9       Jonas   19.0     yes       1
10     Suresh   15.5     yes       1

In [15]:
df.to_csv("df.csv")
my_data=pd.read_csv('df.csv')
my_data

    Unnamed: 0       name  score qualify  result
0            0  Anastasia   12.5     yes       1
1            1       Dima    9.0      no       0
2            2  Katherine   16.5     yes       1
3            3      James    NaN      no       0
4            4      Emily    9.0      no       0
5            5    Michael   20.0     yes       1
6            6    Matthew   14.5     yes       1
7            7      Laura    NaN      no       0
8            8      Kevin    8.0      no       0
9            9      Jonas   19.0     yes       1
10          10     Suresh   15.5     yes       1